raceTest/Setup/Poly/w2f/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0;

relaxationNames     ( inlet outlet);

initializationName  inlet;

inletCoeffs
{
    waveType            irregular;
    spectrum            JONSWAP;
    N                   500;
    Tsoft               0.8;
    Hs                  1.5;
    Tp                  8;
    gamma               3.3;
    depth               70;
    direction           ( 1 0 0 );
    spectramValues  nonuniform List<scalar> 
501
(
0
0
0
0
0
0
0
0
...
)
;

    fspectrum       nonuniform List<scalar> 
501
(
0.01
0.01084
0.01168
0.01252
0.01336
0.0142
0.01504
0.01588
...
)
;

    amplitude           nonuniform List<scalar>
    500
    (
        0
        0
        0
        0
        0
        0
        0
        0
...
    );
    frequency           nonuniform List<scalar>
    500
    (
        0.01042
        0.01126
        0.0121
        0.01294
        0.01378
        0.01462
        0.01546
        0.0163
...
    );
    phaselag            nonuniform List<scalar>
    500
    (
        3.19998
        1.97949
        5.09999
        2.68757
        2.0085
        4.67769
        4.4141
        3.76969
...
    );
    waveNumber          nonuniform List<vector>
    500
    (
        (0.00251122 0 0)
        (0.002716 0 0)
        (0.00292132 0 0)
        (0.00312724 0 0)
        (0.00333379 0 0)
        (0.00354102 0 0)
        (0.00374897 0 0)
        (0.00395769 0 0)
...
    );

    frequencyAxis
    {
        discretisation      equidistantFrequencyAxis;
        lowerFrequencyCutoff 0.01;
        upperFrequencyCutoff 0.43;
        writeSpectrum       true;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( -200 0 -70 );
        endX                ( 0 5 7 );
        orientation         ( 1 0 0 );
    }
}

outletCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               0.8;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           OUTLET;
        startX              ( 200 0 -70 );
        endX                ( 400 5 7 );
        orientation         ( 1 0 0 );
    }
}


// ************************************************************************* //
